<?php
/*
* 基础架构: 单点低代码开发平台
* 版权所有: 郑州单点科技软件有限公司
* Email: moodle360@qq.com
* Copyright (c) 2007-2025
* License: 商业授权
*/
header("Content-Type: application/json"); 
require_once('cors.php');
require_once('include.inc.php');

//$externalId = 16;

//CheckAuthUserLoginStatus();


$报表页面 = [];
$报表页面['搜索区域'] = [];
$报表页面['搜索区域']['标题'] = "固定资产数据统计";
$报表页面['搜索区域']['搜索条件'][] = ['name'=>'选择学期', 'type'=>'选择学期', 'field'=>'选择学期', 'default'=> '当前学期', 'memo'=>'选择学期'];
$报表页面['搜索区域']['搜索条件'][] = ['name'=>'选择系部', 'type'=>'选择系部', 'field'=>'选择系部', 'default'=> '', 'memo'=>'选择系部'];
$报表页面['搜索区域']['搜索条件'][] = ['name'=>'选择专业', 'type'=>'选择专业', 'field'=>'选择专业', 'default'=> '', 'memo'=>'选择专业'];
$报表页面['搜索区域']['搜索条件'][] = ['name'=>'选择班级', 'type'=>'我的班级', 'field'=>'我的班级', 'default'=> '', 'memo'=>'我的班级', '额外限制'=>'班主任'];
$报表页面['搜索区域']['搜索条件'][] = ['name'=>'选择班级', 'type'=>'选择班级', 'field'=>'选择班级', 'default'=> '', 'memo'=>'选择班级', '额外限制'=>'全校'];
$报表页面['搜索区域']['搜索条件'][] = ['name'=>'开始时间', 'type'=>'date1', 'field'=>'开始时间', 'default'=> date('Y-m-d'), 'memo'=>'请输入开始时间'];
$报表页面['搜索区域']['搜索条件'][] = ['name'=>'结束时间', 'type'=>'date2', 'field'=>'结束时间', 'default'=> date('Y-m-d', strtotime('+3 days')), 'memo'=>'请输入结束时间'];
$报表页面['搜索区域']['搜索条件'][] = ['name'=>'开始月份', 'type'=>'date1', 'field'=>'开始月份', 'default'=> date('Y-m-d'), 'memo'=>'请输入开始月份'];
$报表页面['搜索区域']['搜索条件'][] = ['name'=>'结束月份', 'type'=>'date2', 'field'=>'结束月份', 'default'=> date('Y-m-d', strtotime('+3 days')), 'memo'=>'请输入结束月份'];
$报表页面['搜索区域']['搜索条件'][] = ['name'=>'固定资产名称', 'type'=>'input', 'field'=>'固定资产名称', 'default'=> '', 'memo'=>'请输入固定资产名称'];
$报表页面['搜索区域']['搜索按钮']   = "开始查询";
$报表页面['搜索区域']['搜索事件']   = "action=search";


$报表页面['数据区域']['头部'][0][]   = ['name'=>'序号', 'col'=>1, 'row'=>2, 'link'=>''];
$报表页面['数据区域']['头部'][0][]   = ['name'=>'教职工姓名', 'col'=>1, 'row'=>2, 'link'=>''];
$报表页面['数据区域']['头部'][0][]   = ['name'=>'调课', 'col'=>5, 'row'=>1, 'link'=>''];
$报表页面['数据区域']['头部'][0][]   = ['name'=>'相互调课', 'col'=>5, 'row'=>1, 'link'=>''];
$报表页面['数据区域']['头部'][0][]   = ['name'=>'代课', 'col'=>5, 'row'=>1, 'link'=>''];
$报表页面['数据区域']['头部'][0][]   = ['name'=>'代课(自习课)', 'col'=>1, 'row'=>2, 'link'=>''];

$报表页面['数据区域']['头部'][1][]   = ['name'=>'公假', 'col'=>1, 'row'=>1, 'link'=>''];
$报表页面['数据区域']['头部'][1][]   = ['name'=>'病假', 'col'=>1, 'row'=>1, 'link'=>''];
$报表页面['数据区域']['头部'][1][]   = ['name'=>'事假', 'col'=>1, 'row'=>1, 'link'=>''];
$报表页面['数据区域']['头部'][1][]   = ['name'=>'因公', 'col'=>1, 'row'=>1, 'link'=>''];
$报表页面['数据区域']['头部'][1][]   = ['name'=>'因私', 'col'=>1, 'row'=>1, 'link'=>''];
$报表页面['数据区域']['头部'][1][]   = ['name'=>'公假', 'col'=>1, 'row'=>1, 'link'=>''];
$报表页面['数据区域']['头部'][1][]   = ['name'=>'病假', 'col'=>1, 'row'=>1, 'link'=>''];
$报表页面['数据区域']['头部'][1][]   = ['name'=>'事假', 'col'=>1, 'row'=>1, 'link'=>''];
$报表页面['数据区域']['头部'][1][]   = ['name'=>'因公', 'col'=>1, 'row'=>1, 'link'=>''];
$报表页面['数据区域']['头部'][1][]   = ['name'=>'因私', 'col'=>1, 'row'=>1, 'link'=>''];
$报表页面['数据区域']['头部'][1][]   = ['name'=>'公假', 'col'=>1, 'row'=>1, 'link'=>''];
$报表页面['数据区域']['头部'][1][]   = ['name'=>'病假', 'col'=>1, 'row'=>1, 'link'=>''];
$报表页面['数据区域']['头部'][1][]   = ['name'=>'事假', 'col'=>1, 'row'=>1, 'link'=>''];
$报表页面['数据区域']['头部'][1][]   = ['name'=>'因公', 'col'=>1, 'row'=>1, 'link'=>''];
$报表页面['数据区域']['头部'][1][]   = ['name'=>'因私', 'col'=>1, 'row'=>1, 'link'=>''];


$报表页面['数据区域']['数据']   = [];

$报表页面['数据区域']['数据'][0]['序号']   = 1;
$报表页面['数据区域']['数据'][0]['教职工姓名']   = 1;
$报表页面['数据区域']['数据'][0]['调课-公假']   = 1;
$报表页面['数据区域']['数据'][0]['调课-病假']   = 1;
$报表页面['数据区域']['数据'][0]['调课-事假']   = 1;
$报表页面['数据区域']['数据'][0]['调课-因公']   = 1;
$报表页面['数据区域']['数据'][0]['调课-因私']   = 1;

$报表页面['数据区域']['数据'][0]['相互调课-公假']   = 1;
$报表页面['数据区域']['数据'][0]['相互调课-病假']   = 1;
$报表页面['数据区域']['数据'][0]['相互调课-事假']   = 1;
$报表页面['数据区域']['数据'][0]['相互调课-因公']   = 1;
$报表页面['数据区域']['数据'][0]['相互调课-因私']   = 1;

$报表页面['数据区域']['数据'][0]['代课-公假']   = 1;
$报表页面['数据区域']['数据'][0]['代课-病假']   = 1;
$报表页面['数据区域']['数据'][0]['代课-事假']   = 1;
$报表页面['数据区域']['数据'][0]['代课-因公']   = 1;
$报表页面['数据区域']['数据'][0]['代课-因私']   = 1;


$报表页面['底部区域']['备注']   = '底部区域-备注';


print json_encode($报表页面);

?>